## Question 1. Understanding docker first run

In [ ]:
# Run docker with the python:3.12.8 image in an interactive mode, use the entrypoint bash.

# What's the version of pip in the image?

# 24.3.1
# 24.2.1
# 23.3.1
# 23.2.1

In [ ]:
docker run -it python:3.12.8
24.3.1

## Question 2. Understanding Docker networking and docker-compose

In [ ]:
# Given the following docker-compose.yaml, what is the hostname and port that pgadmin should use to connect to the postgres database?

# services:
#   db:
#     container_name: postgres
#     image: postgres:17-alpine
#     environment:
#       POSTGRES_USER: 'postgres'
#       POSTGRES_PASSWORD: 'postgres'
#       POSTGRES_DB: 'ny_taxi'
#     ports:
#       - '5433:5432'
#     volumes:
#       - vol-pgdata:/var/lib/postgresql/data

#   pgadmin:
#     container_name: pgadmin
#     image: dpage/pgadmin4:latest
#     environment:
#       PGADMIN_DEFAULT_EMAIL: "pgadmin@pgadmin.com"
#       PGADMIN_DEFAULT_PASSWORD: "pgadmin"
#     ports:
#       - "8080:80"
#     volumes:
#       - vol-pgadmin_data:/var/lib/pgadmin  

# volumes:
#   vol-pgdata:
#     name: vol-pgdata
#   vol-pgadmin_data:
#     name: vol-pgadmin_data

# postgres:5433
# localhost:5432
# db:5433
# postgres:5432
# db:5432

In [ ]:
Service name as hostname: By default, the service name defined in your 
docker-compose.yml file acts as the hostname for inter-container communication
    
The ports section defines how container ports are mapped to the host machine's ports. 
This mapping allows external access to services running inside containers. 
The format for port mapping is typically "HOST_PORT:CONTAINER_PORT"

# db:5433

## Prepare Postgres

In [ ]:
# Run Postgres and load data as shown in the videos We'll use the green taxi trips from October 2019:

# wget https://github.com/DataTalksClub/nyc-tlc-data/releases/download/green/green_tripdata_2019-10.csv.gz
# You will also need the dataset with zones:

# wget https://github.com/DataTalksClub/nyc-tlc-data/releases/download/misc/taxi_zone_lookup.csv
# Download this data and put it into Postgres.

In [ ]:
# docker run -it \
#   -e POSTGRES_USER="root" \
#   -e POSTGRES_PASSWORD="root" \
#   -e POSTGRES_DB="ny_taxi" \
#   -v $(pwd)/ny_taxi_postgres_data:/var/lib/postgresql/data \
#   -p 5432:5432 \
#   postgres:13

# pgcli -h localhost -p 5432 -u root -d ny_taxi

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from time import time

In [ ]:
df_green_tripdata = pd.read_csv('green_tripdata_2019-10.csv.gz')

In [3]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')
engine.connect()

In [8]:
df_iter = pd.read_csv('green_tripdata_2019-10.csv.gz', 
                      iterator=True, 
                      chunksize=50000,
                      compression='gzip',
                      low_memory=False)

In [9]:
df = next(df_iter)

In [ ]:
df['lpep_pickup_datetime'] = pd.to_datetime(df['lpep_pickup_datetime'])
df['lpep_dropoff_datetime'] = pd.to_datetime(df['lpep_dropoff_datetime'])

In [10]:
# df.head(n=0).to_sql(name='green_trip_data', con=engine, if_exists='replace')
df.to_sql(name='green_trip_data', con=engine, if_exists='append')

1000

In [ ]:
i = 0
while True: 
    t_start = time()

    df = next(df_iter)

    df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
    df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
    
    df.to_sql(name='green_trip_data', con=engine, if_exists='append')

    t_end = time()
    i+=1

    print(f'Iteration {i}: inserted another chunk, took {t_end - t_start} seconds')

In [14]:
df_lookup_iter = pd.read_csv(
    'taxi_zone_lookup.csv', 
    iterator=True, 
    chunksize=50000,
)

In [15]:
df_lookup = next(df_lookup_iter)

In [80]:
df_lookup.columns = ['location_id', 'borough', 'zone', 'service_zone']

In [81]:
df_lookup.head()

   location_id        borough                     zone service_zone
0            1            EWR           Newark Airport          EWR
1            2         Queens              Jamaica Bay    Boro Zone
2            3          Bronx  Allerton/Pelham Gardens    Boro Zone
3            4      Manhattan            Alphabet City  Yellow Zone
4            5  Staten Island            Arden Heights    Boro Zone

In [83]:
df_lookup.to_sql(name='taxi_zone_lookup', con=engine, if_exists='replace')

265

## Question 3. Trip Segmentation Count

In [ ]:
# During the period of October 1st 2019 (inclusive) and November 1st 2019 (exclusive), how many trips, respectively, happened:

# Up to 1 mile
# In between 1 (exclusive) and 3 miles (inclusive),
# In between 3 (exclusive) and 7 miles (inclusive),
# In between 7 (exclusive) and 10 miles (inclusive),
# Over 10 miles

# Answers:
# 104,802; 197,670; 110,612; 27,831; 35,281
# 104,802; 198,924; 109,603; 27,678; 35,189
# 104,793; 201,407; 110,612; 27,831; 35,281
# 104,793; 202,661; 109,603; 27,678; 35,189
# 104,838; 199,013; 109,645; 27,688; 35,202

In [40]:
query = '''
select
    distances, count(*)
from (
    select
        lpep_pickup_datetime,
        lpep_dropoff_datetime,
        trip_distance,
        case
            when trip_distance <= 1 then 'a-up1'
            when trip_distance > 1 and trip_distance <= 3 then 'b-1to3'
            when trip_distance > 3 and trip_distance <= 7 then 'c-3to7'
            when trip_distance > 7 and trip_distance <= 10 then 'd-7to10'
            when trip_distance > 10 then 'e-over10'
        end as distances
    from green_trip_data 
    where date(lpep_pickup_datetime) >= date('2019-10-01') and date(lpep_dropoff_datetime) < date('2019-11-01')
    ) t
group by distances
order by distances
'''

pd.read_sql(query, con=engine)

  distances   count
0     a-up1  104802
1    b-1to3  198924
2    c-3to7  109603
3   d-7to10   27678
4  e-over10   35189

In [ ]:
# 104,802; 198,924; 109,603; 27,678; 35,189

## Question 4. Longest trip for each day

In [ ]:
# Which was the pick up day with the longest trip distance? Use the pick up time for your calculations.

# Tip: For every day, we only care about one single trip with the longest distance.

# 2019-10-11
# 2019-10-24
# 2019-10-26
# 2019-10-31

In [134]:
query = '''
select
    lpep_pickup_datetime,
    lpep_dropoff_datetime,
    trip_distance
from green_trip_data
order by trip_distance desc
limit 3
'''

pd.read_sql(query, con=engine)

  lpep_pickup_datetime lpep_dropoff_datetime  trip_distance
0  2019-10-31 23:23:41   2019-11-01 13:01:07         515.89
1  2019-10-11 20:34:21   2019-10-11 22:40:41          95.78
2  2019-10-26 03:02:39   2019-10-26 07:44:59          91.56

In [49]:
query = '''
select
    date(lpep_pickup_datetime),
    max(trip_distance)
from green_trip_data
group by date(lpep_pickup_datetime)
order by date(lpep_pickup_datetime)
limit 10
'''

pd.read_sql(query, con=engine)

         date    max
0  2008-10-21   0.00
1  2008-12-31   3.85
2  2009-01-01   7.32
3  2010-09-23   2.72
4  2019-09-19   1.50
5  2019-09-30   1.21
6  2019-10-01  47.42
7  2019-10-02  50.00
8  2019-10-03  44.07
9  2019-10-04  45.18

## Question 5. Three biggest pickup zones

In [ ]:
# Which were the top pickup locations with over 13,000 in total_amount (across all trips) for 2019-10-18?

# Consider only lpep_pickup_datetime when filtering by date.

# East Harlem North, East Harlem South, Morningside Heights
# East Harlem North, Morningside Heights
# Morningside Heights, Astoria Park, East Harlem South
# Bedford, East Harlem North, Astoria Park

In [41]:
df.head()

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
450000,NaN,2019-10-24 04:24:00,2019-10-24 04:46:00,NaN,NaN,55,106,NaN,11.30,32.09,2.75,0.5,0.0,0.00,NaN,0.0,35.34,NaN,NaN,NaN
450001,NaN,2019-10-24 04:03:00,2019-10-24 04:23:00,NaN,NaN,247,68,NaN,10.47,32.54,5.50,0.5,0.0,0.00,NaN,0.0,38.54,NaN,NaN,NaN
450002,NaN,2019-10-24 04:38:00,2019-10-24 05:03:00,NaN,NaN,68,10,NaN,14.52,47.68,2.75,0.5,0.0,6.12,NaN,0.3,57.35,NaN,NaN,NaN
450003,NaN,2019-10-24 04:09:00,2019-10-24 04:28:00,NaN,NaN,191,217,NaN,13.66,57.87,2.75,0.5,0.0,0.00,NaN,0.0,61.12,NaN,NaN,NaN
450004,NaN,2019-10-24 04:57:00,2019-10-24 05:17:00,NaN,NaN,244,107,NaN,9.77,36.89,2.75,0.5,0.0,0.00,NaN,0.0,40.14,NaN,NaN,NaN

In [114]:
query = '''
select z.zone, sum(t.total_amount)
from green_trip_data t
left join taxi_zone_lookup z
on "PULocationID" = z.location_id
where date(t.lpep_pickup_datetime) = date('2019-10-18')
group by z.zone
having sum(t.total_amount) > 13000
order by sum(t.total_amount) desc
'''

pd.read_sql(query, con=engine)

                  zone       sum
0    East Harlem North  18686.68
1    East Harlem South  16797.26
2  Morningside Heights  13029.79

In [ ]:
East Harlem North, East Harlem South, Morningside Heights

## Question 6. Largest tip

In [ ]:
# For the passengers picked up in October 2019 in the zone name "East Harlem North" which was the drop off zone that had the largest tip?

# Note: it's tip , not trip

# We need the name of the zone, not the ID.

# Yorkville West
# JFK Airport
# East Harlem North
# East Harlem South

In [116]:
query = '''
select min(lpep_pickup_datetime), max(lpep_pickup_datetime)
from green_trip_data t
limit 10
'''

pd.read_sql(query, con=engine)

                  min                 max
0 2008-10-21 15:52:05 2019-11-13 08:46:52

In [128]:
query = '''
select l.zone 
from (
    select lpep_pickup_datetime, lpep_dropoff_datetime, "PULocationID", zone, "DOLocationID" as drop_off, tip_amount
    from green_trip_data t
    left join taxi_zone_lookup z
    on "PULocationID" = z.location_id
    where z.zone = 'East Harlem North' and
        date(lpep_pickup_datetime) >= date('2019-10-01') and date(lpep_pickup_datetime) <= date('2019-10-31')
    order by tip_amount desc
    limit 1
) t
left join taxi_zone_lookup l
on t.drop_off = l.location_id
'''

pd.read_sql(query, con=engine)

          zone
0  JFK Airport

In [132]:
query = '''
select lpep_pickup_datetime, lpep_dropoff_datetime, "PULocationID", z1.zone, "DOLocationID", z2.zone, tip_amount
from green_trip_data t
left join taxi_zone_lookup z1 on "PULocationID" = z1.location_id
left join taxi_zone_lookup z2 on "DOLocationID" = z2.location_id
where z1.zone = 'East Harlem North' and
    date(lpep_pickup_datetime) >= date('2019-10-01') and date(lpep_pickup_datetime) <= date('2019-10-31')
order by tip_amount desc
limit 5
'''

pd.read_sql(query, con=engine)

,lpep_pickup_datetime,lpep_dropoff_datetime,PULocationID,zone,DOLocationID,zone,tip_amount
0,2019-10-25 15:50:05,2019-10-25 16:50:07,74,East Harlem North,132,JFK Airport,87.30
1,2019-10-28 06:05:56,2019-10-28 06:09:47,74,East Harlem North,263,Yorkville West,80.88
2,2019-10-24 14:35:52,2019-10-24 14:36:32,74,East Harlem North,74,East Harlem North,40.00
3,2019-10-01 00:42:36,2019-10-01 00:43:02,74,East Harlem North,74,East Harlem North,35.00
4,2019-10-20 15:14:27,2019-10-20 16:18:12,74,East Harlem North,1,Newark Airport,26.45

In [ ]:
JFK Airport

## Question 7. Terraform Workflow

In [ ]:
# Which of the following sequences, respectively, describes the workflow for:

# Downloading the provider plugins and setting up backend,
# Generating proposed changes and auto-executing the plan
# Remove all resources managed by terraform`
# Answers:

# terraform import, terraform apply -y, terraform destroy
# teraform init, terraform plan -auto-apply, terraform rm
# terraform init, terraform run -auto-aprove, terraform destroy
  terraform init, terraform apply -auto-aprove, terraform destroy
# terraform import, terraform apply -y, terraform rm